# FloorAttrDefaultThicknessParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FloorAttrDefaultThicknessParam Property
ParameterTypeId Class See Also
---
"Default Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FloorAttrDefaultThicknessParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorAttrDefaultThicknessParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FloorAttrDefaultThicknessParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace